Repository: hha0x617/Em68030_WinUI3Cpp
Catalog: Em68030/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp

# MainWindow_Title
source: Em68030 - MC68030 Emulator (C++/WinUI3)
ja_jp: Em68030 - MC68030 エミュレータ (C++/WinUI3)

# Menu_File
source: File
ja_jp: ファイル

# Menu_OpenBinary
source: Open Binary...
ja_jp: バイナリを開く...

# Menu_OpenSRecord
source: Open S-Record...
ja_jp: S-Record を開く...

# Menu_OpenElf
source: Open ELF...
ja_jp: ELF を開く...

# Menu_Exit
source: Exit
ja_jp: 終了

# Menu_Run
source: Run
ja_jp: 実行

# Menu_RunF5
source: Run (F5)
ja_jp: 実行 (F5)

# Menu_StopShiftF5
source: Stop (Shift+F5)
ja_jp: 停止 (Shift+F5)

# Menu_StepF10
source: Step (F10)
ja_jp: ステップ (F10)

# Menu_RunToCursor
source: Run to Cursor (F4)
ja_jp: カーソルまで実行 (F4)

# Menu_SetPCToCursor
source: Set PC to Cursor
ja_jp: PC をカーソル位置に設定

# Menu_Reset
source: CPU Reset
ja_jp: CPU リセット

# Menu_FullReset
source: Full Reset
ja_jp: フルリセット

# Menu_View
source: View
ja_jp: 表示

# Menu_ConsoleWindow
source: Serial Console Window
ja_jp: コンソール ウィンドウ

# Menu_FramebufferWindow
source: Framebuffer Window
ja_jp: フレームバッファ ウィンドウ

# Menu_BreakpointsWindow
source: Breakpoints Window
ja_jp: ブレークポイント ウィンドウ

# Menu_ToggleLstView
source: Toggle LST View
ja_jp: LST 表示切替

# Menu_Settings
source: Settings
ja_jp: 設定

# Menu_EmulatorSettings
source: Emulator Settings...
ja_jp: エミュレータ設定...

# Menu_Help
source: Help
ja_jp: ヘルプ

# Menu_About
source: About...
ja_jp: バージョン情報...

# Toolbar_Run
source: Run (F5)
ja_jp: 実行 (F5)

# Toolbar_Stop
source: Stop
ja_jp: 停止

# Toolbar_Step
source: Step (F10)
ja_jp: ステップ (F10)

# Toolbar_Reset
source: CPU Reset
ja_jp: CPU リセット

# Toolbar_FullReset
source: Full Reset
ja_jp: フルリセット

# Toolbar_Trace
source: Trace
ja_jp: トレース

# Disasm_Title
source: Disassembly
ja_jp: 逆アセンブリ

# Disasm_Address
source: Address:
ja_jp: アドレス:

# Disasm_Size
source: Size:
ja_jp: サイズ:

# Disasm_Go
source: Go
ja_jp: 移動

# Disasm_FollowPC
source: Follow PC
ja_jp: PC 追従

# Regs_Title
source: Registers
ja_jp: レジスタ

# Regs_DataRegisters
source: Data Registers
ja_jp: データ レジスタ

# Regs_AddressRegisters
source: Address Registers
ja_jp: アドレス レジスタ

# Regs_Flags
source: Flags
ja_jp: フラグ

# Regs_SpecialRegisters
source: Special Registers
ja_jp: 特殊レジスタ

# Regs_FpuRegisters
source: FPU Registers
ja_jp: FPU レジスタ

# Regs_Edit
source: Edit
ja_jp: 編集

# Regs_Apply
source: Apply
ja_jp: 適用

# Regs_Cancel
source: Cancel
ja_jp: キャンセル

# MemDump_Title
source: Memory Dump
ja_jp: メモリ ダンプ

# MemDump_Address
source: Address:
ja_jp: アドレス:

# MemDump_Size
source: Size:
ja_jp: サイズ:

# MemDump_Go
source: Go
ja_jp: 移動

# MemDump_Edit
source: Edit
ja_jp: 編集

# MemDump_Apply
source: Apply
ja_jp: 適用

# MemDump_Cancel
source: Cancel
ja_jp: キャンセル

# Context_Copy
source: Copy
ja_jp: コピー

# Context_RunToCursor
source: Run to Cursor
ja_jp: ここまで実行

# Context_SetPCToAddress
source: Set PC to Address
ja_jp: このアドレスを PC に設定

# Context_Cancel
source: Cancel
ja_jp: キャンセル

# Context_Paste
source: Paste
ja_jp: 貼り付け

# Context_SelectAll
source: Select All
ja_jp: すべて選択

# Status_Running
source: Running: True
ja_jp: 実行中

# Status_Halted
source: HALTED
ja_jp: 停止 (HALT)

# Status_Stopped
source: STOPPED
ja_jp: 停止

# Status_NotRunning
source: Running: False
ja_jp: 待機中

# Status_FileNone
source: File: (none)
ja_jp: ファイル: (なし)

# Status_FileFormat
source: File: {0}
ja_jp: ファイル: {0}

# Status_CyclesFormat
source: Cycles: {0}
ja_jp: サイクル: {0}

# Status_AvgMhzFormat
source: Avg {0} MHz ({1} MIPS)
ja_jp: 平均 {0} MHz ({1} MIPS)

# About_Title
source: About
ja_jp: バージョン情報

# About_Subtitle
source: MC68030 Emulator (C++/WinUI3)
ja_jp: MC68030 エミュレータ (C++/WinUI3)

# About_BuildFormat
source: Build: {0}
ja_jp: ビルド: {0}

# About_License
source: Licensed under Apache-2.0
ja_jp: Apache-2.0 ライセンス

# Window_Breakpoints
source: Breakpoints
ja_jp: ブレークポイント

# Window_Console
source: Serial Console
ja_jp: コンソール

# Window_ConsoleFormat
source: Serial Console - {0}×{1}
ja_jp: コンソール - {0}×{1}

# Window_Settings
source: Emulator Settings
ja_jp: エミュレータ設定

# Window_Input
source: Input
ja_jp: 入力

# Breakpoints_ClearAll
source: Clear All
ja_jp: すべてクリア

# Breakpoints_Delete
source: Del
ja_jp: 削除

# Dialog_Cancel
source: Cancel
ja_jp: キャンセル

# FileDialog_OpenBinary
source: Open Binary File
ja_jp: バイナリ ファイルを開く

# FileDialog_OpenSRecord
source: Open S-Record File
ja_jp: S-Record ファイルを開く

# FileDialog_OpenElf
source: Open ELF File
ja_jp: ELF ファイルを開く

# FileDialog_LoadAddress
source: Load Address
ja_jp: ロード アドレス

# FileDialog_EnterLoadAddress
source: Enter load address (hex):
ja_jp: ロード アドレスを入力してください (16進数):

# Msg_ElfLoaded
source: ELF loaded successfully.
ja_jp: ELF を読み込みました。

# Msg_ElfLoaderTitle
source: ELF Loader
ja_jp: ELF ローダー

# Msg_ElfLoaderError
source: ELF Loader Error
ja_jp: ELF ローダー エラー

# Msg_FailedToLoadElf
source: Failed to load ELF file:
ja_jp: ELF ファイルの読み込みに失敗しました:

# Msg_LoadError
source: Load Error
ja_jp: 読み込みエラー

# Msg_FailedToLoadBinary
source: Failed to load binary file:
ja_jp: バイナリ ファイルの読み込みに失敗しました:

# Msg_FailedToLoadSRecord
source: Failed to load S-Record file:
ja_jp: S-Record ファイルの読み込みに失敗しました:

# Msg_InvalidHexAddress
source: Invalid hex address.
ja_jp: 無効な16進アドレスです。

# Msg_Error
source: Error
ja_jp: エラー

# Msg_InvalidSize
source: Invalid size.
ja_jp: 無効なサイズです。

# Msg_Success
source: Success
ja_jp: 成功

# Settings_BoardType
source: Board Type
ja_jp: ボード タイプ

# Settings_Board
source: Board:
ja_jp: ボード:

# Settings_Mvme147Settings
source: MVME147 Settings
ja_jp: MVME147 設定

# Settings_RomImage
source: ROM Image:
ja_jp: ROM イメージ:

# Settings_TargetOS
source: Target OS
ja_jp: ターゲット OS

# Settings_OperatingSystem
source: Operating System:
ja_jp: オペレーティング システム:

# Settings_BootPartition
source: Boot Partition:
ja_jp: ブート パーティション:

# Settings_CommandLine
source: Command Line:
ja_jp: コマンド ライン:

# Settings_ScsiDisks
source: SCSI Disks
ja_jp: SCSI ディスク

# Settings_AddDisk
source: + Add Disk
ja_jp: + ディスク追加

# Settings_NewImageSizeMB
source: New Image Size (MB):
ja_jp: 新規イメージ サイズ (MB):

# Settings_Create
source: Create
ja_jp: 作成

# Settings_IsoImage
source: ISO Image:
ja_jp: ISO イメージ:

# Settings_Network
source: Network
ja_jp: ネットワーク

# Settings_NetworkMode
source: Network Mode:
ja_jp: ネットワーク モード:

# Settings_NetworkVirtual
source: Virtual (Echo Server)
ja_jp: 仮想 (エコーサーバー)

# Settings_NetworkNat
source: NAT (Host Network)
ja_jp: NAT (ホスト ネットワーク)

# Settings_GatewayIP
source: Gateway IP:
ja_jp: ゲートウェイ IP:

# Settings_GatewayMAC
source: Gateway MAC:
ja_jp: ゲートウェイ MAC:

# Settings_Memory
source: Memory
ja_jp: メモリ

# Settings_MemorySizeMB
source: Memory Size (MB):
ja_jp: メモリ サイズ (MB):

# Settings_IoDevices
source: I/O Devices
ja_jp: I/O デバイス

# Settings_ConsoleEnabled
source: Console Device Enabled
ja_jp: コンソール デバイス有効

# Settings_ConsoleBaseAddr
source: Console Base Addr:
ja_jp: コンソール ベースアドレス:

# Settings_ScrollbackLines
source: Scrollback Lines:
ja_jp: スクロールバック行数:

# Settings_TerminalSize
source: Terminal Size:
ja_jp: ターミナル サイズ:

# Settings_HddEnabled
source: HDD Device Enabled
ja_jp: HDD デバイス有効

# Settings_HddBaseAddr
source: HDD Base Addr:
ja_jp: HDD ベースアドレス:

# Settings_HddImage
source: HDD Image
ja_jp: HDD イメージ

# Settings_ImageFile
source: Image File:
ja_jp: イメージ ファイル:

# Settings_Performance
source: Performance
ja_jp: パフォーマンス

# Settings_EnableJit
source: Enable JIT Compiler (experimental)
ja_jp: JIT コンパイラを有効にする (実験的)

# Settings_JitDescription
source: Compiles register-only basic blocks to native code at runtime. Currently covers a limited set of instructions (MOVEQ, MOVE.L Dn, ADD/SUB/CMP.L, AND/OR/EOR.L, Bcc.B, BRA.B). May reduce overall speed due to per-instruction overhead exceeding the benefit of compiled blocks.
ja_jp: レジスタ操作のみの基本ブロックを実行時にネイティブコードにコンパイルします。現在対応している命令セットは限定的です (MOVEQ, MOVE.L Dn, ADD/SUB/CMP.L, AND/OR/EOR.L, Bcc.B, BRA.B)。命令ごとのオーバーヘッドがコンパイル済みブロックの効果を上回り、全体的な速度が低下する場合があります。

# Settings_MinBlockLength
source: Min Block Length:
ja_jp: 最小ブロック長:

# Settings_CompileThreshold
source: Compile Threshold:
ja_jp: コンパイル閾値:

# Settings_Framebuffer
source: Framebuffer
ja_jp: フレームバッファ

# Settings_EnableFramebuffer
source: Enable Framebuffer
ja_jp: フレームバッファを有効にする

# Settings_FramebufferDescription
source: Provides a virtual framebuffer for X Window System. VRAM is placed at the top of RAM automatically. Changes take effect after rebooting the guest OS.
ja_jp: X Window System 用の仮想フレームバッファを提供します。VRAM は RAM 末尾に自動配置されます。変更の反映にはゲスト OS の再起動が必要です。

# Settings_FbResolution
source: Resolution:
ja_jp: 解像度:

# Settings_FbBpp
source: Bits per Pixel:
ja_jp: ビット深度:

# Settings_FbVramBase
source: VRAM Base:
ja_jp: VRAM ベースアドレス:

# Settings_Display
source: Display
ja_jp: 表示

# Settings_FontFamily
source: Font Family:
ja_jp: フォント ファミリ:

# Settings_FontSize
source: Font Size:
ja_jp: フォント サイズ:

# Settings_SelectRomImage
source: Select MVME147 ROM Image
ja_jp: MVME147 ROM イメージを選択

# Settings_SelectHddImage
source: Select HDD Image File
ja_jp: HDD イメージ ファイルを選択

# Settings_SelectScsiDisk
source: Select SCSI Disk Image
ja_jp: SCSI ディスク イメージを選択

# Settings_SelectCdRomIso
source: Select SCSI CD-ROM ISO Image
ja_jp: SCSI CD-ROM ISO イメージを選択

# Settings_CreateScsiDisk
source: Create SCSI Disk Image
ja_jp: SCSI ディスク イメージを作成

# Settings_CreateHddImage
source: Create HDD Image File
ja_jp: HDD イメージ ファイルを作成

# Settings_WriteDisklabel
source: Write NetBSD Disklabel
ja_jp: NetBSD Disklabel の書き込み

# Settings_DisklabelConfirm
source: Write a NetBSD disklabel to this disk image? This overwrites the first sector of the image with a NetBSD-format partition table. Only use this for NetBSD disk images.
ja_jp: このディスク イメージに NetBSD disklabel を書き込みますか？ イメージの先頭セクタを NetBSD 形式のパーティション テーブルで上書きします。 NetBSD ディスク イメージに対してのみ使用してください。

# Settings_CreatedScsiDiskFormat
source: Created {0}MB SCSI disk image ({1}): {2}
ja_jp: {0}MB SCSI ディスク イメージを作成しました ({1}): {2}

# Settings_CreatedHddImageFormat
source: Created {0}MB image: {1}
ja_jp: {0}MB イメージを作成しました: {1}

# Status_BreakpointFormat
source: Breakpoint at ${0}
ja_jp: ブレークポイント (${0})

# Status_InfiniteLoopFormat
source: Infinite loop detected at ${0}
ja_jp: 無限ループ検出 (${0})

# Status_TraceOn
source: [TRACE ON]
ja_jp: [トレース ON]

# Msg_ElfLoadedFormat
source: ELF loaded successfully. Entry: ${0} Range: ${1}-${2} {3} segments loaded
ja_jp: ELF を読み込みました。 エントリ: ${0} 範囲: ${1}-${2} {3} セグメントをロード
